In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame({
    'Empleado': ['Juan', 'Ana', 'Pedro', 'Luis','Maria','Ana','Pedro','Luis','Maria'],
    'Departamento': ['Ventas', 'Marketing','Ventas', 'IT','Marketing','IT', 'Ventas', 'Marketing','Ventas'],
    'Salario': [50000, 60000, 55000, 58000, 62000, 60000,55000,58000,62000 ],
    'Años_Experiencia': [5, 7, 6, 8, 9, 7, 6, 8, 9],
    'Ciudad': ['Madrid', 'Barcelona', 'Madrid', 'Sevilla', 'Barcelona', 'Sevilla', 'Madrid', 'Barcelona', 'Sevilla']})

display(df)

  Empleado Departamento  Salario  Años_Experiencia     Ciudad
0     Juan       Ventas    50000                 5     Madrid
1      Ana    Marketing    60000                 7  Barcelona
2    Pedro       Ventas    55000                 6     Madrid
3     Luis           IT    58000                 8    Sevilla
4    Maria    Marketing    62000                 9  Barcelona
5      Ana           IT    60000                 7    Sevilla
6    Pedro       Ventas    55000                 6     Madrid
7     Luis    Marketing    58000                 8  Barcelona
8    Maria       Ventas    62000                 9    Sevilla

In [ ]:
df['Departamento']

0       Ventas
1    Marketing
2       Ventas
3           IT
4    Marketing
5           IT
6       Ventas
7    Marketing
8       Ventas
Name: Departamento, dtype: object

In [8]:
df['Departamento'] = df['Departamento'].astype('category')
df['Ciudad'] = df['Ciudad'].astype('category')
display(df.dtypes)

df['Departamento']

Empleado              object
Departamento        category
Salario                int64
Años_Experiencia       int64
Ciudad              category
dtype: object

0       Ventas
1    Marketing
2       Ventas
3           IT
4    Marketing
5           IT
6       Ventas
7    Marketing
8       Ventas
Name: Departamento, dtype: category
Categories (3, object): ['IT', 'Marketing', 'Ventas']

In [ ]:
#Listar las categorías
df['Departamento'].cat.categories

Index(['IT', 'Marketing', 'Ventas'], dtype='object')

In [ ]:
#Acceder a los códigos de las categorías
df['Departamento'].cat.codes

0    2
1    1
2    2
3    0
4    1
5    0
6    2
7    1
8    2
dtype: int8

In [13]:
#Ordenar las categorías
df['Departamento'] = df['Departamento'].cat.reorder_categories(['IT', 'Ventas', 'Marketing'], ordered=True)
display(df['Departamento'])

0       Ventas
1    Marketing
2       Ventas
3           IT
4    Marketing
5           IT
6       Ventas
7    Marketing
8       Ventas
Name: Departamento, dtype: category
Categories (3, object): ['IT' < 'Ventas' < 'Marketing']

In [ ]:
#Agregar una nueva categoría y un nuevo empleado
df['Departamento'] = df['Departamento'].cat.add_categories(['RRHH'])
df.loc[len(df)] = ['Sofia', 'RRHH', 48000, 4, 'Madrid']
display(df)

  Empleado Departamento  Salario  Años_Experiencia     Ciudad
0     Juan       Ventas    50000                 5     Madrid
1      Ana    Marketing    60000                 7  Barcelona
2    Pedro       Ventas    55000                 6     Madrid
3     Luis           IT    58000                 8    Sevilla
4    Maria    Marketing    62000                 9  Barcelona
5      Ana           IT    60000                 7    Sevilla
6    Pedro       Ventas    55000                 6     Madrid
7     Luis    Marketing    58000                 8  Barcelona
8    Maria       Ventas    62000                 9    Sevilla
9    Sofia         RRHH    48000                 4     Madrid

In [19]:
df['Departamento'] = df['Departamento'].astype('category')
df['Departamento']

0       Ventas
1    Marketing
2       Ventas
3           IT
4    Marketing
5           IT
6       Ventas
7    Marketing
8       Ventas
9         RRHH
Name: Departamento, dtype: category
Categories (4, object): ['IT', 'Marketing', 'RRHH', 'Ventas']

In [20]:
df['Departamento'].cat.categories

Index(['IT', 'Marketing', 'RRHH', 'Ventas'], dtype='object')

In [21]:
#Eliminar una categoría
df['Departamento'] = df['Departamento'].cat.remove_categories(['RRHH'])

In [22]:
df

  Empleado Departamento  Salario  Años_Experiencia     Ciudad
0     Juan       Ventas    50000                 5     Madrid
1      Ana    Marketing    60000                 7  Barcelona
2    Pedro       Ventas    55000                 6     Madrid
3     Luis           IT    58000                 8    Sevilla
4    Maria    Marketing    62000                 9  Barcelona
5      Ana           IT    60000                 7    Sevilla
6    Pedro       Ventas    55000                 6     Madrid
7     Luis    Marketing    58000                 8  Barcelona
8    Maria       Ventas    62000                 9    Sevilla
9    Sofia          NaN    48000                 4     Madrid

In [26]:
#Codificacion won-hot
df_encoded = pd.get_dummies(df['Departamento'], prefix='Dept').astype(int)
display(df_encoded)

   Dept_IT  Dept_Marketing  Dept_Ventas
0        0               0            1
1        0               1            0
2        0               0            1
3        1               0            0
4        0               1            0
5        1               0            0
6        0               0            1
7        0               1            0
8        0               0            1
9        0               0            0

In [27]:
#Agrupar por categoría
df_grouped = df.groupby('Departamento')['Salario'].sum()
display(df_grouped)

C:\Users\Admin\AppData\Local\Temp\ipykernel_28756\2756629553.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df_grouped = df.groupby('Departamento')['Salario'].sum()

Departamento
IT           118000
Marketing    180000
Ventas       222000
Name: Salario, dtype: int64